erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/СХК_МобильныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСклад</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/InformationRegisters/СХК_РазмещениеОрдер/СХК_РазмещениеОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СХК_РазмещениеОрдер</name>
  <dimensions>
    <name>ДокументОрдер</name>
    <type>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СХК_СкладЯчейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Catalogs/СХК_СкладЯчейки/СХК_СкладЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СХК_СкладЯчейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМестимость</name>
    <type>
      <types>EnumRef.СХК_ВМестимость</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/Forms/ФормаРазместитьОрдер/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	ЭтаФорма.ДокументОрдер = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();

	Если СтруктураПараметров.ДокументОрдер <> "" Тогда
		ДокументОрдер = СтруктураПараметров.ДокументОрдер;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТЧ();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ()
	
	ЭтаФорма.ТЧЯчеек.Очистить();
	ЭтаФорма.ТЧЯчеек.Загрузить(СХК_ТСДСклад.ПоискОрдераЯчейки(ЭтаФорма.ДокументОрдер));
	
КонецПроцедуры

&НаКлиенте
Процедура СканЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если ВыборЯчейки(Текст) = Истина Тогда

	Иначе
		ОткрытьФормуСообщения("Неверный штрихкод ячейки");	
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ВыборЯчейки(Текст) 

	Ош = Истина;
	
	Я = Справочники.СХК_СкладЯчейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(Текст));
	Если Я.Пустая() = Ложь Тогда 
        Т = ТЧЯчеек.Добавить();
		Т.Ячейка = Я;
		Ош = Истина;
	Иначе
		Ош = Ложь;
	КонецЕсли;
	
	Возврат Ош; 
	
КонецФункции


&НаКлиенте
Процедура ОткрытьФормуСообщения(Сообщение) 
	Отбор = Новый Структура;
	Отбор.Вставить("Ошибка",Строка(Сообщение));
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(Отбор,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСообщения", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.ФормаСообщений", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСообщения(Значение, ДопПараметры) Экспорт 
						
КонецПроцедуры

&НаКлиенте
Процедура Разместить(Команда)
	РазместитьНаСервере();   
	ЭтаФорма.Закрыть();
КонецПроцедуры  

&НаСервере
Процедура РазместитьНаСервере()
	Таб = ЭтаФорма.ТЧЯчеек.Выгрузить();
	Таб.Свернуть("Ячейка");
	
	Для Каждого стр из Таб Цикл
		НоваяЗапись = РегистрыСведений.СХК_РазмещениеОрдер.СоздатьМенеджерЗаписи();
    	НоваяЗапись.Период = ТекущаяДата();
    	НоваяЗапись.ДокументОрдер = ДокументОрдер.Ссылка;
    	НоваяЗапись.Ячейка = стр.Ячейка;
	    НоваяЗапись.Записать(Истина);
	КонецЦикла;
	
	
КонецПроцедуры
